# ~/dev/dotfiles/Brewfile
# macOS: brew bundle --file=~/dev/dotfiles/Brewfile
# Linux: packages are handled by install.sh (apt/dnf + release binaries)

# Shell & prompt
brew "bash"
brew "bash-completion@2"
brew "starship"
brew "atuin"
brew "fzf"
brew "zoxide"

# Git
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "glab"
brew "gnupg"

# Ruby
brew "rv"

# Editors
brew "vim"

# Terminal tools
brew "bat"
brew "eza"
brew "fd"
brew "htop"
brew "jq"
brew "procs"
brew "ripgrep"
brew "smug"
brew "tealdeer"
brew "tmux"
brew "wget"

# Image & PDF compression
brew "jpegoptim"
brew "pngquant"
brew "oxipng"
brew "ghostscript"
brew "img2pdf"
brew "qpdf"

# Fonts
cask "font-iosevka-term-nerd-font"

# Terminal emulator (macOS only)
cask "ghostty"
