# ~/dev/dotfiles/Brewfile
# macOS: brew bundle --file=~/dev/dotfiles/Brewfile
# Linux: packages are handled by install.sh (apt/dnf + release binaries)

tap "modem-dev/tap"

# Shell & prompt
brew "bash"
brew "bash-completion@2"
brew "fzf"
brew "mise"

# Git
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "glab"
brew "gnupg"
brew "lazygit"
brew "modem-dev/tap/hunk"

# Directory environment
brew "direnv"

# Editors
brew "vim"

# Terminal tools
brew "bat"
brew "dtop"
brew "eza"
brew "fd"
brew "htop"
brew "jq"
brew "lazydocker"
brew "libpq"
brew "mysql-client"
brew "procs"
brew "ripgrep"
brew "rtk"
brew "smug"
brew "sops"
brew "tealdeer"
brew "tmux"
brew "wget"
brew "yq"

# Image & PDF compression
brew "jpegoptim"
brew "pngquant"
brew "oxipng"
brew "ghostscript"
brew "img2pdf"
brew "qpdf"

# Fonts
cask "font-iosevka-term-nerd-font"

# Terminal emulator (macOS only)
cask "ghostty"
cask "claude-code"
cask "codex"
cask "copilot-cli"
